#+STARTUP: fold

** vector optimize
#+begin_src C++ :results output
#include<iostream>
#include<vector>
using namespace std;
struct Vertex{
    float x,y,z;
    Vertex(float x,float y,float z):x(x),y(y),z(z){}
    Vertex(const Vertex& vertex):x(vertex.x),y(vertex.y),z(vertex.z){
        cout<<"copied"<<endl;
        }
    };
int main(){
    vector<Vertex> vertices;
    vertices.reserve(3);
    cout<<vertices.capacity()<<endl;
    // vertices.push_back({1,2,3});
    // vertices.push_back({4,5,6});
    // vertices.push_back(Vertex(7,8,9));
    vertices.emplace_back(1,2,3);//moves
    Vertex v{4,5,6};
    vertices.emplace_back(v);//copied
    vertices.emplace_back(Vertex(7,8,9));//copied
    }
#+end_src

#+RESULTS:
: 3
: copied
: copied

*** Conflict
- In Math.cpp
#+begin_src C++ :results output
int math(int a,int b){
    int result = a+b;
    return result;
}
#+end_src
- In main.cpp
#+begin_src C++ :results output
#include<iostream>
using namespace std;
static int math(int,int);
int main()
{
    cout<<"hello "<<math(2,3);
    return 0;
}
int math(int a,int b){
    return a*b;
}
#+end_src

#+RESULTS:
: hello 6

+ Static function without class means this function for made only for this cpp file.

- In Math.cpp
#+begin_src C++ :results output
static int math(int a,int b){
    int result = a+b;
    return result;
}
#+end_src
- In main.cpp
#+begin_src C++ :results output
#include<iostream>
using namespace std;
int math(int,int);
int main()
{
    cout<<"hello"<<math(2,3);
    return 0;
}
#+end_src
- Result is linking error

* Loop
#+begin_src C++ :results output
#include<iostream>
using namespace std;
int main(){
  int i = 0;
  bool condition = true;
  for (; condition;) {
    cout << "ok" << endl;
    i++;
    if (!(i < 5)) {
      condition = false;
    }
  }
  return 0;
}
#+end_src

#+RESULTS:
: ok
: ok
: ok
: ok
: ok
* Array vs Pointer
- Array allocate memory and hold address but, pointer just hold address
Yes strcmp should be used there but it works in the case because when he wrote "Hello" in the if condition that is a character constant in the static memory and the variable pointer ptr points to a "Hello" in the same static memory and they basically have the same address, so basically he just compared the address that ptr holds to the address of "Hello" and in the static memory they both are at the same address.
To better understand this consider the following code:
#+begin_src C++ :results output
#include<iostream>
int main(){
    const char *ptr = "Hello World!";
    const char *ptr2= "Hello World!";
    if (ptr == ptr2)
        std::cout << "Same!";
    else
        std::cout << "Not Same!";
    return 0;
}
#+end_src

#+RESULTS:
: Same!

This will print Same! because "Hello World!" is a character constant and stored in the static memory and both the pointers point to the same address hence ptr is infact equal to ptr2  ( the address they hold is same).
Now consider this code.
#+begin_src C++ :results output
#include<iostream>
int main(){
    const char ptr[] = "Hello World!";
    const char ptr2[] = "Hello World!";
    if (ptr == ptr2)
        std::cout << "Same!";
    else
        std::cout << "Not Same!";
    return 0;
}
#+end_src

#+RESULTS:
: Not Same!

This will give "Not Same!" because this time it is not a character constant it is a character array and it is stored on the stack and both pointers point to a different address.
So this time ptr is not holding the same address as ptr2 though the content is same.
* Size of Int
#+begin_src C++ :results output
#include<iostream>
using std::cout;
int main(){
    cout<<sizeof(int16_t);
    }
#+end_src

#+RESULTS:
: 2
* Deep Copy
#+begin_src C++ :results output
#include<iostream>
#include<string.h>
using namespace std;
class myString{
    char *my_buffer;
    unsigned int my_string_size;
    public:
        myString(const char *s){
            my_string_size=strlen(s);
            my_buffer=new char[my_string_size+1];
            memcpy(my_buffer,s,my_string_size);
            my_buffer[my_string_size]= *"\0";
            }
        // myString(const myString &str):my_buffer(str.my_buffer),my_string_size(str.my_string_size){}
        // myString(const myString &str){memcpy(this,&str,sizeof(myString))}
        myString(const myString &str):my_string_size(str.my_string_size){
            my_buffer=new char[my_string_size+1];
            memcpy(my_buffer,str.my_buffer,my_string_size+1);
            }
        ~myString(){
            delete []my_buffer;
            }
        char& operator [](unsigned int index){return my_buffer[index];}
        friend ostream &operator<<(ostream&,const myString&);
};
ostream &operator <<(ostream &dout,const myString &st){
    dout<<st.my_buffer;
    return(dout);
}
int main(){
    myString s1="Dragon";
    myString s2=s1;
    s2[1]= *"a";
    s2[2]= *"r";
    cout<<s1<<endl<<s2;
    }
#+end_src

#+RESULTS:
: Dragon
: Dargon

* Arrow operator
#+begin_src C++ :results output
#include<iostream>
#include<cstdint>
using namespace std;
struct Vector3{
    float x,z,y;
    };
int main(){
    Vector3* p = new Vector3;
    // uint64_t offset = (uint64_t)&(*(Vector3*)0).y;
    uint64_t offset = ((uint64_t)&((Vector3*)p)->z) - ((uint64_t)p);
    cout<<offset<<endl;
    cout << (int*) &((Vector3*)nullptr) -> z << endl;
    // cout << (intptr_t) &((Vector3*) nullptr) -> z << endl;
    }
#+end_src

#+RESULTS:
: 4
: 0x4

The arrow operator can also be used with "trailing return type" syntax (c++11).

For example:

#+begin_src C++ :results output
auto function1(int value) -> int
{
    return value;
}

// which is the same as:

auto function2(int value) -> decltype(value)
{
    return value;
}

// This is the exact same thing as: (C++14)

decltype(auto) function3(int value)
{
    return value;
}
int main(){}
#+end_src

#+RESULTS:
* Return multiple values
#+begin_src C++ :results output
#include<iostream>
using namespace std;
struct values{int x;float y;};
values fun(bool flg){
    if(flg) return {1,2.5};
    }
int main(){
    values v;
    v=fun(true);
    cout<<v.x<<v.y;
    }
#+end_src

#+RESULTS:
: 12.5
